---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.GetTableData
source: html/5369a4b6-3b0b-e880-956c-0c2520e7022d.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.GetTableData Method

Gets table data that can be written to

## Syntax (C#)
```csharp
public PanelScheduleData GetTableData()
```

## Returns
The PanelScheduleData